In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("employee_salaries.csv")
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [3]:
X = df.drop('salary_more_then_100k', axis='columns')
y = df['salary_more_then_100k']

In [4]:
from sklearn.preprocessing import LabelEncoder
LblEncd_company = LabelEncoder()
LblEncd_job = LabelEncoder()
LblEncd_degree = LabelEncoder()

In [8]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   company  16 non-null     object
 1   job      16 non-null     object
 2   degree   16 non-null     object
dtypes: object(3)
memory usage: 512.0+ bytes

In [10]:
X['company_num'] = LblEncd_company.fit_transform(X['company'])
X['job_num'] = LblEncd_job.fit_transform(X['job'])
X['degree_num'] = LblEncd_degree.fit_transform(X['degree'])

In [11]:
X

,company,job,degree,company_num,job_num,degree_num
0,google,sales executive,bachelors,2,2,0
1,google,sales executive,masters,2,2,1
2,google,business manager,bachelors,2,0,0
3,google,business manager,masters,2,0,1
4,google,computer programmer,bachelors,2,1,0
5,google,computer programmer,masters,2,1,1
6,abc pharma,sales executive,masters,0,2,1
7,abc pharma,computer programmer,bachelors,0,1,0
8,abc pharma,business manager,bachelors,0,0,0
9,abc pharma,business manager,masters,0,0,1
10,facebook,sales executive,bachelors,1,2,0
11,facebook,sales executive,masters,1,2,1
12,facebook,business manager,bachelors,1,0,0
13,facebook,business manager,masters,1,0,1
14,facebook,computer programmer,bachelors,1,1,0
15,facebook,computer programmer,masters,1,1,1

In [12]:
X_num = X.drop(['company','job','degree'], axis='columns')
X_num

    company_num  job_num  degree_num
0             2        2           0
1             2        2           1
2             2        0           0
3             2        0           1
4             2        1           0
5             2        1           1
6             0        2           1
7             0        1           0
8             0        0           0
9             0        0           1
10            1        2           0
11            1        2           1
12            1        0           0
13            1        0           1
14            1        1           0
15            1        1           1

In [13]:
y

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [17]:
from sklearn import tree
dcsion_tree_model = tree.DecisionTreeClassifier()
dcsion_tree_model

DecisionTreeClassifier()

In [18]:
dcsion_tree_model.fit(X_num, y)

DecisionTreeClassifier()

In [20]:
dcsion_tree_model.score(X_num, y)

1.0

#### Salary of Google, Computer programmer, Bachelors degree > 100 k ? Yes(1) or No(0)

In [21]:
dcsion_tree_model.predict([[2,1,0]])

array([0])

The output is zero(0) means ans is No

#### Salary of Google, Computer Engineer, Masters degree > 100 k ? (1/0)

In [22]:
dcsion_tree_model.predict([[2,1,1]])

array([1])

The output is one(1) means ans is Yes

#### Let's Check slary of

#### 8. abc pharma	business manager	bachelors	0	0	0

In [24]:
dcsion_tree_model.predict([[0, 0, 0]])

array([0])

Not more than 100K

#### Salary of Google, sales executive, Masters degree > 100 k ? (1/0)

In [26]:
dcsion_tree_model.predict([[2,2,1]])

array([0])

#### 15	facebook	computer programmer	masters	1	1	1

In [27]:
dcsion_tree_model.predict([[2,1,1]])

array([1])